zephyrproject-rtos/zephyr/drivers/can/can_stm32_bxcan.c
	if ((filter->flags & ~(CAN_FILTER_IDE)) != 0) {
		LOG_ERR("unsupported CAN filter flags 0x%02x", filter->flags);
		return -ENOTSUP;
	}

	k_mutex_lock(&filter_mutex, K_FOREVER);
	k_mutex_lock(&data->inst_mutex, K_FOREVER);

	filter_id = can_stm32_set_filter(dev, filter);
	if (filter_id >= 0) {
		if ((filter->flags & CAN_FILTER_IDE) != 0) {
			data->rx_cb_ext[filter_id] = cb;
			data->cb_arg_ext[filter_id] = cb_arg;
		} else {
			data->rx_cb_std[filter_id - CONFIG_CAN_STM32_BXCAN_MAX_EXT_ID_FILTERS] = cb;
			data->cb_arg_std[filter_id - CONFIG_CAN_STM32_BXCAN_MAX_EXT_ID_FILTERS] =
				cb_arg;
		}
	}

	k_mutex_unlock(&data->inst_mutex);
	k_mutex_unlock(&filter_mutex);

	return filter_id;
}

static void can_stm32_remove_rx_filter(const struct device *dev, int filter_id)
{
	const struct can_stm32_config *cfg = dev->config;
	struct can_stm32_data *data = dev->data;
	CAN_TypeDef *can = cfg->master_can;
	bool ide = filter_id < CONFIG_CAN_STM32_BXCAN_MAX_EXT_ID_FILTERS;
	int bank_offset = can_stm32_bank_offset(cfg);
	int bank_num;

	if (filter_id < 0 || filter_id >= CAN_STM32_MAX_FILTER_ID) {
		LOG_ERR("filter ID %d out of bounds", filter_id);
		return;
	}

	k_mutex_lock(&filter_mutex, K_FOREVER);
	k_mutex_lock(&data->inst_mutex, K_FOREVER);

	LOG_DBG("Removing filter_id %d, ide %d", filter_id, ide);

	if (ide) {
		bank_num = bank_offset + filter_id;

		/* disable filter bank before clearing callback data */
		can->FA1R &= ~(1U << bank_num);

		data->rx_cb_ext[filter_id] = NULL;
		data->cb_arg_ext[filter_id] = NULL;
	} else {
		int filter_index = filter_id - CONFIG_CAN_STM32_BXCAN_MAX_EXT_ID_FILTERS;

		bank_num = bank_offset + CONFIG_CAN_STM32_BXCAN_MAX_EXT_ID_FILTERS +
			   (filter_id - CONFIG_CAN_STM32_BXCAN_MAX_EXT_ID_FILTERS) / 2;

		/* disable filter bank before clearing callback data */
		can->FA1R &= ~(1U << bank_num);

		data->rx_cb_std[filter_index] = NULL;
		data->cb_arg_std[filter_index] = NULL;

		if (data->rx_cb_std[filter_index ^ 1] != NULL) {
			/* bank's other half is still in use, mirror the active filter */
			if (filter_index % 2 != 0) {
				can->sFilterRegister[bank_num].FR2 =
					can->sFilterRegister[bank_num].FR1;
			} else {
				can->sFilterRegister[bank_num].FR1 =
					can->sFilterRegister[bank_num].FR2;
			}
			can->FA1R |= (1U << bank_num);
		}
	}

	k_mutex_unlock(&data->inst_mutex);
	k_mutex_unlock(&filter_mutex);
}

static DEVICE_API(can, can_api_funcs) = {
	.get_capabilities = can_stm32_get_capabilities,
	.start = can_stm32_start,
	.stop = can_stm32_stop,
	.set_mode = can_stm32_set_mode,
	.set_timing = can_stm32_set_timing,
	.send = can_stm32_send,
	.add_rx_filter = can_stm32_add_rx_filter,
	.remove_rx_filter = can_stm32_remove_rx_filter,
	.get_state = can_stm32_get_state,
#ifdef CONFIG_CAN_MANUAL_RECOVERY_MODE
	.recover = can_stm32_recover,
#endif /* CONFIG_CAN_MANUAL_RECOVERY_MODE */
	.state_change_callbacks_enabled = can_stm32_state_change_callbacks_enabled,
	.get_core_clock = can_stm32_get_core_clock,
	.get_max_filters = can_stm32_get_max_filters,
	.timing_min = {
		.sjw = 0x1,
		.prop_seg = 0x00,
		.phase_seg1 = 0x01,
		.phase_seg2 = 0x01,
		.prescaler = 0x01
	},
	.timing_max = {
		.sjw = 0x04,
		.prop_seg = 0x00,
		.phase_seg1 = 0x10,
		.phase_seg2 = 0x08,
		.prescaler = 0x400
	}
};

#ifdef CONFIG_SOC_SERIES_STM32F0X
#define CAN_STM32_IRQ_INST(inst)							\
	static void config_can_##inst##_irq(CAN_TypeDef *can)				\
	{										\
		IRQ_CONNECT(DT_INST_IRQN(inst),						\
			    DT_INST_IRQ(inst, priority),				\
			    can_stm32_isr, DEVICE_DT_INST_GET(inst), 0);		\
		irq_enable(DT_INST_IRQN(inst));						\
		can->IER |= CAN_IER_TMEIE | CAN_IER_ERRIE | CAN_IER_FMPIE0 |		\
			    CAN_IER_FMPIE1 | CAN_IER_BOFIE;				\
		if (IS_ENABLED(CONFIG_CAN_STATS)) {					\
			can->IER |= CAN_IER_LECIE;					\
		}									\
	}
#else /* CONFIG_SOC_SERIES_STM32F0X */
#define CAN_STM32_IRQ_INST(inst)							\
	static void config_can_##inst##_irq(CAN_TypeDef *can)				\
	{										\
		IRQ_CONNECT(DT_INST_IRQ_BY_NAME(inst, rx0, irq),			\
			    DT_INST_IRQ_BY_NAME(inst, rx0, priority),			\
			    can_stm32_rx_isr, DEVICE_DT_INST_GET(inst), 0);		\
		irq_enable(DT_INST_IRQ_BY_NAME(inst, rx0, irq));			\
		IRQ_CONNECT(DT_INST_IRQ_BY_NAME(inst, tx, irq),				\
			    DT_INST_IRQ_BY_NAME(inst, tx, priority),			\
			    can_stm32_tx_isr, DEVICE_DT_INST_GET(inst), 0);		\
		irq_enable(DT_INST_IRQ_BY_NAME(inst, tx, irq));				\
		IRQ_CONNECT(DT_INST_IRQ_BY_NAME(inst, sce, irq),			\
			    DT_INST_IRQ_BY_NAME(inst, sce, priority),			\
			    can_stm32_state_change_isr,					\
			    DEVICE_DT_INST_GET(inst), 0);				\
		irq_enable(DT_INST_IRQ_BY_NAME(inst, sce, irq));			\
		can->IER |= CAN_IER_TMEIE | CAN_IER_ERRIE | CAN_IER_FMPIE0 |		\
			    CAN_IER_FMPIE1 | CAN_IER_BOFIE;				\
		if (IS_ENABLED(CONFIG_CAN_STATS)) {					\
			can->IER |= CAN_IER_LECIE;					\
		}									\
	}
#endif /* CONFIG_SOC_SERIES_STM32F0X */

#define CAN_STM32_CONFIG_INST(inst)							\
	PINCTRL_DT_INST_DEFINE(inst);							\
	static const struct can_stm32_config can_stm32_cfg_##inst = {			\
		.common = CAN_DT_DRIVER_CONFIG_INST_GET(inst, 0, 1000000),		\
		.can = (CAN_TypeDef *)DT_INST_REG_ADDR(inst),				\
		.master_can = (CAN_TypeDef *)DT_INST_PROP_OR(inst,			\
					master_can_reg, DT_INST_REG_ADDR(inst)),	\
		.pclken = STM32_DT_INST_CLOCK_INFO(inst),				\
		.config_irq = config_can_##inst##_irq,					\
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(inst),				\
	};

#define CAN_STM32_DATA_INST(inst) \
	static struct can_stm32_data can_stm32_dev_data_##inst;

#define CAN_STM32_DEFINE_INST(inst)							\
	CAN_DEVICE_DT_INST_DEFINE(inst, can_stm32_init, NULL,				\
				  &can_stm32_dev_data_##inst, &can_stm32_cfg_##inst,	\
				  POST_KERNEL, CONFIG_CAN_INIT_PRIORITY,		\
				  &can_api_funcs);

#define CAN_STM32_INST(inst)		\
	CAN_STM32_IRQ_INST(inst)	\
	CAN_STM32_CONFIG_INST(inst)	\
	CAN_STM32_DATA_INST(inst)	\
	CAN_STM32_DEFINE_INST(inst)

DT_INST_FOREACH_STATUS_OKAY(CAN_STM32_INST)
